Repository: alkimya/pycopg
Catalog: docs/locale/*/LC_MESSAGES/async-database.po
Languages: fr

source: AsyncDatabase Class
fr: Classe AsyncDatabase

source: The `AsyncDatabase` class provides async/await support for all database operations.
fr: La classe `AsyncDatabase` fournit le support async/await pour toutes les opérations de base de données.

source: Connection
fr: Connexion

source: Query Execution
fr: Exécution de requêtes

source: Execute SQL for multiple parameter sets. Uses `executemany()` internally for better performance.
fr: Exécuter du SQL pour plusieurs jeux de paramètres. Utilise `executemany()` en interne pour de meilleures performances.

source: High-performance batch insert using a single INSERT with multiple VALUES tuples.
fr: Insertion par lot haute performance utilisant un seul INSERT avec plusieurs tuples VALUES.

source: Ultra-fast bulk insert using PostgreSQL's COPY protocol.
fr: Insertion en masse ultra-rapide utilisant le protocole COPY de PostgreSQL.

source: Session Mode
fr: Mode session

source: Session mode keeps a single connection open for multiple operations, reducing connection overhead.
fr: Le mode session maintient une seule connexion ouverte pour plusieurs opérations, réduisant le surcoût de connexion.

source: **Note:** Nested sessions are not supported and will raise a `RuntimeError`.
fr: **Note :** Les sessions imbriquées ne sont pas supportées et lèveront une `RuntimeError`.

source: Context Managers
fr: Gestionnaires de contexte

source: Async connection context manager.
fr: Gestionnaire de contexte de connexion async.

source: Async cursor context manager with dict rows.
fr: Gestionnaire de contexte de curseur async avec lignes dict.

source: Transaction context manager with automatic commit/rollback.
fr: Gestionnaire de contexte de transaction avec commit/rollback automatique.

source: Streaming Results
fr: Résultats en streaming

source: For large result sets, use streaming to avoid loading everything into memory.
fr: Pour les gros jeux de résultats, utilisez le streaming pour éviter de tout charger en mémoire.

source: Batch Operations
fr: Opérations par lot

source: Efficiently insert multiple rows.
fr: Insérer efficacement plusieurs lignes.

source: Insert or update rows based on conflict columns.
fr: Insérer ou mettre à jour des lignes selon les colonnes de conflit.

source: PostgreSQL's pub/sub mechanism for real-time notifications.
fr: Mécanisme pub/sub de PostgreSQL pour les notifications en temps réel.

source: Send a notification.
fr: Envoyer une notification.

source: Listen for notifications.
fr: Écouter les notifications.

source: Schema Operations
fr: Opérations sur les schémas

source: All schema exploration methods are available asynchronously.
fr: Toutes les méthodes d'exploration de schéma sont disponibles de manière asynchrone.

source: Complete Example
fr: Exemple complet
