Repository: alkimya/pycopg
Catalog: docs/locale/*/LC_MESSAGES/backup-restore.po
Languages: fr

source: Backup & Restore
fr: Sauvegarde et restauration

source: pycopg provides convenient wrappers around PostgreSQL's backup and restore tools.
fr: pycopg fournit des wrappers pratiques autour des outils de sauvegarde et restauration de PostgreSQL.

source: Full Database Backup
fr: Sauvegarde complète de la base

source: Backup Options
fr: Options de sauvegarde

source: Schema Only
fr: Schéma uniquement

source: Data Only
fr: Données uniquement

source: Specific Tables
fr: Tables spécifiques

source: Specific Schemas
fr: Schémas spécifiques

source: Parallel Backup
fr: Sauvegarde parallèle

source: Full Restore
fr: Restauration complète

source: Restore Options
fr: Options de restauration

source: Clean Restore
fr: Restauration propre

source: Parallel Restore
fr: Restauration parallèle

source: Restore Specific Tables
fr: Restaurer des tables spécifiques

source: Restore Without Ownership
fr: Restaurer sans les propriétés

source: Plain SQL Restore
fr: Restauration SQL brut

source: For plain SQL backups, pycopg uses psql automatically.
fr: Pour les sauvegardes SQL brut, pycopg utilise psql automatiquement.

source: CSV Export/Import
fr: Export/Import CSV

source: Export to CSV
fr: Exporter en CSV

source: Import from CSV
fr: Importer depuis un CSV

source: Complete Backup Strategy
fr: Stratégie de sauvegarde complète

source: Development Backup
fr: Sauvegarde de développement

source: Production Backup Script
fr: Script de sauvegarde production

source: Migration with Backup
fr: Migration avec sauvegarde

source: Clone Database
fr: Cloner une base de données

source: Error Handling
fr: Gestion des erreurs

source: Best Practices
fr: Bonnes pratiques

source: 1. Use Custom Format for Production
fr: 1. Utilisez le format custom en production

source: 2. Test Restores Regularly
fr: 2. Testez les restaurations régulièrement

source: 3. Include Backup in CI/CD
fr: 3. Intégrez les sauvegardes au CI/CD

source: 4. Monitor Backup Size
fr: 4. Surveillez la taille des sauvegardes
