Repository: alkimya/pycopg
Catalog: docs/locale/*/LC_MESSAGES/connection-pooling.po
Languages: fr

source: Connection Pooling
fr: Pool de connexions

source: Connection pooling improves performance by reusing database connections instead of creating new ones for each request.
fr: Le pool de connexions améliore les performances en réutilisant les connexions à la base de données au lieu d'en créer de nouvelles pour chaque requête.

source: When to Use Pooling
fr: Quand utiliser le pooling

source: Use connection pooling when:
fr: Utilisez le pool de connexions quand :

source: Building web applications with many concurrent requests
fr: Vous construisez des applications web avec de nombreuses requêtes concurrentes

source: Running background workers that need frequent database access
fr: Vous exécutez des workers en arrière-plan nécessitant des accès fréquents à la base

source: Any application where connection overhead is significant
fr: Toute application où le surcoût de connexion est significatif

source: Sync Pool: PooledDatabase
fr: Pool synchrone : PooledDatabase

source: Context Manager
fr: Gestionnaire de contexte

source: Pool Statistics
fr: Statistiques du pool

source: Dynamic Resizing
fr: Redimensionnement dynamique

source: Async Pool: AsyncPooledDatabase
fr: Pool asynchrone : AsyncPooledDatabase

source: Async Context Manager
fr: Gestionnaire de contexte async

source: Pool Configuration
fr: Configuration du pool

source: Parameter
fr: Paramètre

source: Default
fr: Défaut

source: Minimum connections to maintain
fr: Nombre minimum de connexions à maintenir

source: Maximum connections allowed
fr: Nombre maximum de connexions autorisées

source: Close idle connections after N seconds
fr: Fermer les connexions inactives après N secondes

source: Close connections after N seconds
fr: Fermer les connexions après N secondes

source: Wait timeout for getting a connection
fr: Délai d'attente pour obtenir une connexion

source: Background workers for pool management
fr: Workers en arrière-plan pour la gestion du pool

source: Best Practices
fr: Bonnes pratiques

source: 1. Size Your Pool Appropriately
fr: 1. Dimensionnez votre pool correctement

source: 2. Use Connection Context Managers
fr: 2. Utilisez les gestionnaires de contexte de connexion

source: 3. Handle Pool Exhaustion
fr: 3. Gérez l'épuisement du pool

source: 4. Monitor Pool Health
fr: 4. Surveillez la santé du pool

source: FastAPI Integration
fr: Intégration FastAPI

source: Flask Integration
fr: Intégration Flask
