Repository: alkimya/pycopg
Catalog: docs/locale/*/LC_MESSAGES/database.po
Languages: fr

source: Database Class
fr: Classe Database

source: The `Database` class is the main synchronous interface for pycopg.
fr: La classe `Database` est l'interface synchrone principale de pycopg.

source: Connection
fr: Connexion

source: Query Execution
fr: Exécution de requêtes

source: Execute SQL and return results as list of dicts.
fr: Exécuter du SQL et retourner les résultats sous forme de liste de dicts.

source: Execute SQL for multiple parameter sets. Uses `executemany()` internally for better performance.
fr: Exécuter du SQL pour plusieurs jeux de paramètres. Utilise `executemany()` en interne pour de meilleures performances.

source: High-performance batch insert using a single INSERT with multiple VALUES tuples. Significantly faster than `execute_many()` for large inserts.
fr: Insertion par lot haute performance utilisant un seul INSERT avec plusieurs tuples VALUES. Significativement plus rapide que `execute_many()` pour les gros volumes.

source: Ultra-fast bulk insert using PostgreSQL's COPY protocol. 10-100x faster than INSERT for large datasets.
fr: Insertion en masse ultra-rapide utilisant le protocole COPY de PostgreSQL. 10 à 100 fois plus rapide que INSERT pour les gros jeux de données.

source: Fetch a single row as dict.
fr: Récupérer une seule ligne sous forme de dict.

source: Fetch a single value.
fr: Récupérer une seule valeur.

source: Session Mode
fr: Mode session

source: Session mode keeps a single connection open for multiple operations, significantly reducing connection overhead.
fr: Le mode session maintient une seule connexion ouverte pour plusieurs opérations, réduisant significativement le surcoût de connexion.

source: **Note:** Nested sessions are not supported and will raise a `RuntimeError`.
fr: **Note :** Les sessions imbriquées ne sont pas supportées et lèveront une `RuntimeError`.

source: Context Managers
fr: Gestionnaires de contexte

source: Low-level connection context manager.
fr: Gestionnaire de contexte de connexion bas niveau.

source: Cursor context manager with dict row factory.
fr: Gestionnaire de contexte de curseur avec factory de lignes dict.

source: Database Exploration
fr: Exploration de la base de données

source: Schemas
fr: Schémas

source: Size & Statistics
fr: Taille et statistiques

source: Indexes & Constraints
fr: Index et contraintes

source: Indexes
fr: Index

source: Constraints
fr: Contraintes

source: DataFrame Operations
fr: Opérations DataFrame

source: Database Administration
fr: Administration de la base de données
