Repository: alkimya/pycopg
Catalog: docs/locale/*/LC_MESSAGES/getting-started.po
Languages: fr

source: Getting Started
fr: Démarrage rapide

source: Basic Installation
fr: Installation de base

source: With Optional Dependencies
fr: Avec les dépendances optionnelles

source: Quick Start
fr: Prise en main

source: Connecting to a Database
fr: Connexion à une base de données

source: There are three ways to connect:
fr: Il y a trois façons de se connecter :

source: From Environment Variables
fr: Depuis les variables d'environnement

source: From URL
fr: Depuis une URL

source: From Config Object
fr: Depuis un objet Config

source: Create a New Database
fr: Créer une nouvelle base de données

source: Create a new database and connect to it in one step:
fr: Créer une nouvelle base de données et s'y connecter en une seule étape :

source: Basic Operations
fr: Opérations de base

source: Session Mode
fr: Mode session

source: For multiple sequential operations, use session mode to reuse a single connection:
fr: Pour plusieurs opérations séquentielles, utilisez le mode session pour réutiliser une seule connexion :

source: Using Context Managers
fr: Utilisation des gestionnaires de contexte

source: Closing Connections
fr: Fermeture des connexions

source: Next Steps
fr: Étapes suivantes

source: {doc}`configuration` - Learn about all configuration options
fr: {doc}`configuration` - Découvrir toutes les options de configuration

source: {doc}`database` - Explore the full Database API
fr: {doc}`database` - Explorer l'API Database complète

source: {doc}`async-database` - Use async/await with AsyncDatabase
fr: {doc}`async-database` - Utiliser async/await avec AsyncDatabase

source: {doc}`connection-pooling` - Connection pooling for production
fr: {doc}`connection-pooling` - Pool de connexions pour la production
