Repository: alkimya/pycopg
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: fr

source: Contents
fr: Sommaire

source: pycopg Documentation
fr: Documentation pycopg

source: High-level Python API for PostgreSQL/PostGIS/TimescaleDB built on [psycopg 3](https://www.psycopg.org/psycopg3/).
fr: API Python haut niveau pour PostgreSQL/PostGIS/TimescaleDB basée sur [psycopg 3](https://www.psycopg.org/psycopg3/).

source: Features
fr: Fonctionnalités

source: **Simple API**: Pythonic interface for common database operations
fr: **API simple** : Interface pythonique pour les opérations courantes

source: **Sync & Async**: Full async/await support with `AsyncDatabase`
fr: **Sync & Async** : Support complet async/await avec `AsyncDatabase`

source: **Session Mode**: Connection reuse for batch operations with `db.session()`
fr: **Mode session** : Réutilisation de connexion pour les opérations par lot avec `db.session()`

source: **High-Performance Inserts**: `insert_batch()` and `copy_insert()` for bulk operations
fr: **Insertions haute performance** : `insert_batch()` et `copy_insert()` pour les opérations en masse

source: **Connection Pooling**: Built-in pooling with `PooledDatabase` and `AsyncPooledDatabase`
fr: **Pool de connexions** : Pooling intégré avec `PooledDatabase` et `AsyncPooledDatabase`

source: **DataFrame Integration**: Seamless pandas/geopandas support
fr: **Intégration DataFrame** : Support transparent pandas/geopandas

source: **Migrations**: Simple SQL-based migration system
fr: **Migrations** : Système de migration basé sur SQL

source: **PostGIS**: Spatial data operations with GeoDataFrame support
fr: **PostGIS** : Opérations spatiales avec support GeoDataFrame

source: **TimescaleDB**: Hypertables, compression, and retention policies
fr: **TimescaleDB** : Hypertables, compression et politiques de rétention

source: **Role Management**: Create roles, grant/revoke privileges
fr: **Gestion des rôles** : Création de rôles, attribution/révocation de privilèges

source: **Backup/Restore**: pg_dump/pg_restore and CSV import/export
fr: **Sauvegarde/Restauration** : pg_dump/pg_restore et import/export CSV

source: **Type Safety**: Full type hints for IDE support
fr: **Typage** : Annotations de type complètes pour le support IDE

source: Quick Example
fr: Exemple rapide

source: License
fr: Licence

source: MIT License - Copyright (c) 2026 Loc Cosnier
fr: Licence MIT - Copyright (c) 2026 Loc Cosnier

source: Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
fr: La permission est accordée, gratuitement, à toute personne obtenant une copie de ce logiciel et des fichiers de documentation associés (le « Logiciel »), de traiter le Logiciel sans restriction, y compris, sans limitation, les droits d'utiliser, copier, modifier, fusionner, publier, distribuer, sous-licencier et/ou vendre des copies du Logiciel, et de permettre aux personnes à qui le Logiciel est fourni de le faire, sous réserve des conditions suivantes :

source: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
fr: L'avis de copyright ci-dessus et cet avis de permission doivent être inclus dans toutes les copies ou parties substantielles du Logiciel.

source: THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
fr: LE LOGICIEL EST FOURNI « TEL QUEL », SANS GARANTIE D'AUCUNE SORTE, EXPRESSE OU IMPLICITE, Y COMPRIS, MAIS SANS S'Y LIMITER, LES GARANTIES DE QUALITÉ MARCHANDE, D'ADÉQUATION À UN USAGE PARTICULIER ET DE NON-CONTREFAÇON. EN AUCUN CAS LES AUTEURS OU LES DÉTENTEURS DU COPYRIGHT NE SERONT RESPONSABLES DE TOUTE RÉCLAMATION, DOMMAGE OU AUTRE RESPONSABILITÉ, QUE CE SOIT DANS UNE ACTION CONTRACTUELLE, DÉLICTUELLE OU AUTRE, DÉCOULANT DE, OU EN RELATION AVEC LE LOGICIEL OU L'UTILISATION OU AUTRES TRANSACTIONS DU LOGICIEL.
