Repository: alkimya/pycopg
Catalog: docs/locale/*/LC_MESSAGES/migrations.po
Languages: fr

source: pycopg includes a simple SQL-based migration system for managing database schema changes.
fr: pycopg inclut un système de migration SQL simple pour gérer les changements de schéma de base de données.

source: Quick Start
fr: Prise en main

source: 1. Create Migration Directory
fr: 1. Créer le répertoire de migrations

source: 2. Create Migration Files
fr: 2. Créer les fichiers de migration

source: 3. Run Migrations
fr: 3. Exécuter les migrations

source: Migration File Format
fr: Format des fichiers de migration

source: File Naming
fr: Nommage des fichiers

source: Migration files must follow this naming convention:
fr: Les fichiers de migration doivent suivre cette convention de nommage :

source: `NNN`: Version number (1, 01, 001, etc.)
fr: `NNN` : Numéro de version (1, 01, 001, etc.)

source: `description`: Snake_case description
fr: `description` : Description en snake_case

source: `.sql`: Required extension
fr: `.sql` : Extension requise

source: Examples:
fr: Exemples :

source: File Structure
fr: Structure des fichiers

source: Migrations can have optional UP and DOWN sections:
fr: Les migrations peuvent avoir des sections UP et DOWN optionnelles :

source: If no UP/DOWN sections are present, the entire file is treated as the UP migration.
fr: Si aucune section UP/DOWN n'est présente, le fichier entier est traité comme la migration UP.

source: Migrator API
fr: API Migrator

source: Creating a Migrator
fr: Créer un Migrator

source: Checking Status
fr: Vérifier le statut

source: Running Migrations
fr: Exécuter les migrations

source: Rolling Back
fr: Annulation (rollback)

source: Creating New Migrations
fr: Créer de nouvelles migrations

source: The created file includes a template:
fr: Le fichier créé inclut un modèle :

source: Listing Migrations
fr: Lister les migrations

source: Migration Tracking
fr: Suivi des migrations

source: Migrations are tracked in a database table (default: `schema_migrations`):
fr: Les migrations sont suivies dans une table de base de données (défaut : `schema_migrations`) :

source: Examples
fr: Exemples

source: Creating Tables
fr: Création de tables

source: Adding Columns
fr: Ajout de colonnes

source: Creating Relations
fr: Création de relations

source: Data Migrations
fr: Migrations de données

source: Complex Migrations
fr: Migrations complexes

source: Error Handling
fr: Gestion des erreurs

source: Best Practices
fr: Bonnes pratiques

source: 1. Make Migrations Idempotent
fr: 1. Rendez les migrations idempotentes

source: 2. Always Include DOWN Migrations
fr: 2. Incluez toujours les migrations DOWN

source: 3. Keep Migrations Small and Focused
fr: 3. Gardez les migrations petites et ciblées

source: 4. Never Modify Applied Migrations
fr: 4. Ne modifiez jamais les migrations appliquées

source: Once a migration is applied, create a new migration for changes:
fr: Une fois une migration appliquée, créez une nouvelle migration pour les modifications :

source: 5. Test Migrations Both Directions
fr: 5. Testez les migrations dans les deux sens
