Repository: alkimya/pycopg
Catalog: docs/locale/*/LC_MESSAGES/postgis.po
Languages: fr

source: PostGIS Support
fr: Support PostGIS

source: pycopg provides first-class support for PostGIS spatial operations with GeoPandas integration.
fr: pycopg fournit un support de première classe pour les opérations spatiales PostGIS avec intégration GeoPandas.

source: Prerequisites
fr: Prérequis

source: PostGIS extension installed on your PostgreSQL server
fr: Extension PostGIS installée sur votre serveur PostgreSQL

source: GeoPandas installed: `pip install pycopg[geo]`
fr: GeoPandas installé : `pip install pycopg[geo]`

source: Setup
fr: Configuration

source: Creating Spatial Tables
fr: Création de tables spatiales

source: From GeoDataFrame
fr: Depuis un GeoDataFrame

source: Reading Spatial Data
fr: Lecture de données spatiales

source: Full Table
fr: Table complète

source: With SQL Query
fr: Avec une requête SQL

source: Spatial Indexes
fr: Index spatiaux

source: Create GIST Index
fr: Créer un index GIST

source: Using Regular Index API
fr: Utilisation de l'API d'index standard

source: Listing Geometry Columns
fr: Lister les colonnes géométriques

source: Common Spatial Operations
fr: Opérations spatiales courantes

source: Point in Polygon
fr: Point dans un polygone

source: Distance Queries
fr: Requêtes de distance

source: Buffer
fr: Buffer (zone tampon)

source: Centroid
fr: Centroïde

source: Area and Perimeter
fr: Aire et périmètre

source: Coordinate Reference Systems
fr: Systèmes de référence de coordonnées

source: Checking CRS
fr: Vérifier le CRS

source: Transforming CRS
fr: Transformer le CRS

source: Setting SRID
fr: Définir le SRID

source: Example: Spatial Analysis
fr: Exemple : Analyse spatiale
