Repository: alkimya/pycopg
Catalog: docs/locale/*/LC_MESSAGES/roles-permissions.po
Languages: fr

source: Roles & Permissions
fr: Rôles et permissions

source: pycopg provides comprehensive role and permission management for PostgreSQL.
fr: pycopg fournit une gestion complète des rôles et permissions pour PostgreSQL.

source: Creating Roles
fr: Création de rôles

source: Basic User
fr: Utilisateur de base

source: With Options
fr: Avec options

source: Group Roles
fr: Rôles de groupe

source: Group roles don't log in but grant permissions to members.
fr: Les rôles de groupe ne se connectent pas mais accordent des permissions aux membres.

source: Managing Roles
fr: Gestion des rôles

source: Alter Role
fr: Modifier un rôle

source: Drop Role
fr: Supprimer un rôle

source: Check Role Exists
fr: Vérifier si un rôle existe

source: List Roles
fr: Lister les rôles

source: Role Membership
fr: Appartenance aux rôles

source: Grant Role
fr: Accorder un rôle

source: Revoke Role
fr: Révoquer un rôle

source: List Role Members
fr: Lister les membres d'un rôle

source: Granting Privileges
fr: Accorder des privilèges

source: On Tables
fr: Sur les tables

source: On All Tables in Schema
fr: Sur toutes les tables d'un schéma

source: On Schemas
fr: Sur les schémas

source: On Databases
fr: Sur les bases de données

source: With Grant Option
fr: Avec option de transmission

source: Revoking Privileges
fr: Révoquer des privilèges

source: Basic Revoke
fr: Révocation de base

source: Cascade Revoke
fr: Révocation en cascade

source: On Schemas and Databases
fr: Sur les schémas et bases de données

source: Listing Grants
fr: Lister les autorisations

source: Common Patterns
fr: Patterns courants

source: Read-Only User
fr: Utilisateur en lecture seule

source: Application User
fr: Utilisateur applicatif

source: Admin User
fr: Utilisateur administrateur

source: Team Hierarchy
fr: Hiérarchie d'équipe

source: Row-Level Security
fr: Sécurité au niveau des lignes (RLS)

source: For fine-grained access control, use PostgreSQL's RLS.
fr: Pour un contrôle d'accès fin, utilisez le RLS de PostgreSQL.

source: Best Practices
fr: Bonnes pratiques

source: 1. Use Role Hierarchy
fr: 1. Utilisez une hiérarchie de rôles

source: 2. Principle of Least Privilege
fr: 2. Principe du moindre privilège

source: 3. Use Separate Roles for Apps
fr: 3. Utilisez des rôles séparés pour les applications

source: 4. Regular Audits
fr: 4. Audits réguliers
