Repository: alkimya/pycopg
Catalog: docs/locale/*/LC_MESSAGES/timescaledb.po
Languages: fr

source: TimescaleDB Support
fr: Support TimescaleDB

source: pycopg provides built-in support for TimescaleDB, a PostgreSQL extension for time-series data.
fr: pycopg fournit un support intégré pour TimescaleDB, une extension PostgreSQL pour les données temporelles.

source: Prerequisites
fr: Prérequis

source: TimescaleDB extension installed on your PostgreSQL server
fr: Extension TimescaleDB installée sur votre serveur PostgreSQL

source: Regular pycopg installation (no additional packages needed)
fr: Installation standard de pycopg (pas de paquets supplémentaires nécessaires)

source: Setup
fr: Configuration

source: Creating Hypertables
fr: Création d'hypertables

source: A hypertable is TimescaleDB's core table type, automatically partitioning data by time.
fr: Une hypertable est le type de table principal de TimescaleDB, partitionnant automatiquement les données par temps.

source: Basic Creation
fr: Création de base

source: With Options
fr: Avec options

source: Common Chunk Intervals
fr: Intervalles de chunk courants

source: Use Case
fr: Cas d'usage

source: Interval
fr: Intervalle

source: High-frequency IoT data
fr: Données IoT haute fréquence

source: Standard metrics
fr: Métriques standards

source: Long-term storage
fr: Stockage long terme

source: `1 week` or `1 month`
fr: `1 week` ou `1 month`

source: Enable compression to reduce storage for older data.
fr: Activez la compression pour réduire le stockage des anciennes données.

source: Enable Compression
fr: Activer la compression

source: Compression Policy
fr: Politique de compression

source: Automatically compress chunks older than a threshold.
fr: Compresser automatiquement les chunks plus anciens qu'un seuil.

source: Data Retention
fr: Rétention des données

source: Automatically drop old data chunks.
fr: Supprimer automatiquement les anciens chunks de données.

source: Listing Hypertables
fr: Lister les hypertables

source: Hypertable Info
fr: Informations sur l'hypertable

source: Time-Series Queries
fr: Requêtes de séries temporelles

source: Time Bucketing
fr: Agrégation temporelle (time bucketing)

source: Last Values
fr: Dernières valeurs

source: Moving Average
fr: Moyenne mobile

source: Gap Filling
fr: Remplissage des lacunes

source: Continuous Aggregates
fr: Agrégats continus

source: Create materialized views that automatically update.
fr: Créer des vues matérialisées qui se mettent à jour automatiquement.

source: Complete Example
fr: Exemple complet

source: Best Practices
fr: Bonnes pratiques

source: 1. Choose Appropriate Chunk Intervals
fr: 1. Choisissez des intervalles de chunk appropriés

source: 2. Use Appropriate Indexes
fr: 2. Utilisez des index appropriés

source: 3. Monitor Chunk Sizes
fr: 3. Surveillez la taille des chunks

source: 4. Use Continuous Aggregates for Dashboards
fr: 4. Utilisez les agrégats continus pour les tableaux de bord

source: Pre-aggregate data for faster dashboard queries instead of computing on the fly.
fr: Pré-agrégez les données pour des requêtes de tableau de bord plus rapides au lieu de calculer à la volée.
